# # Монетки
# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной.

n = int(input("Введите количество монет: "))
gerb = 0
orel = 0
for i in range(n):
    k = int(input(f"Какой стороной лежит {i+1} монета (1 - решкой, 0 - гербом)? "))
    if k == 0:
        gerb += 1
    else:
        orel += 1

if gerb < orel:
    print(gerb)
else:
    print(orel)


